<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'اوصاف قبول کرنا ضروری ہے۔',
    'active_url' => ': وصف ایک درست URL نہیں ہے۔',
    'after' => ': انتساب ایک تاریخ: تاریخ کے بعد ہونا چاہئے۔',
    'after_or_equal' => ': انتساب ایک تاریخ کے بعد یا اس کے مساوی ہونا چاہئے۔',
    'alpha' => ': وصف میں صرف حرف ہوسکتے ہیں۔',
    'alpha_dash' => ': خصوصیت میں صرف حرف ، نمبر ، ڈیش اور انڈر سکور ہوسکتے ہیں۔',
    'alpha_num' => ': خصوصیت میں صرف حرف اور نمبر شامل ہوسکتے ہیں۔',
    'array' => ': خصوصیت ایک صف ہونا چاہئے۔',
    'before' => ': انتساب ایک تاریخ سے پہلے کی تاریخ کا ہونا چاہئے۔',
    'before_or_equal' => ': وصف کی تاریخ سے پہلے یا اس کے مساوی ہونا چاہئے۔',
    'between' => [
        'numeric' => ': خاصیت کا درمیان ہونا چاہئے: کم سے کم اور: زیادہ سے زیادہ۔',
        'file' => ': خاصیت کا درمیان ہونا چاہئے: کم سے کم اور: زیادہ سے زیادہ کلو بائٹ۔',
        'string' => ': خاصیت کا ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ حروف۔',
        'array' => ': خاصیت کے درمیان ہونا چاہئے: منٹ اور: زیادہ سے زیادہ آئٹمز۔',
    ],
    'boolean' => ': خصوصیت کا فیلڈ صحیح یا غلط ہونا چاہئے۔',
    'confirmed' => ': انتساب کی توثیق مماثل نہیں ہے۔',
    'date' => ': وصف ایک درست تاریخ نہیں ہے۔',
    'date_equals' => ': انتساب کی تاریخ اس کے برابر ہونی چاہئے۔',
    'date_format' => ': انتساب فارمیٹ سے نہیں ملتا ہے: فارمیٹ۔',
    'different' => ': اوصاف اور: دوسرا مختلف ہونا چاہئے۔',
    'digits' => 'ہندسہ: ہندسہ ہونا چاہئے۔',
    'digits_between' => ': خاصیت کا ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ ہندسے۔',
    'dimensions' => ': وصف میں غلط تصویری جہت ہے۔',
    'distinct' => ': خصوصیت کے فیلڈ میں ایک ڈپلیکیٹ ویلیو ہے۔',
    'email' => ': وصف ایک درست ای میل پتہ ہونا چاہئے۔',
    'ends_with' => ': خصوصیت کا اختتام مندرجہ ذیل میں سے ایک کے ساتھ ہونا چاہئے:: اقدار۔',
    'exists' => 'منتخب کردہ: وصف غلط ہے۔',
    'file' => ': خصوصیت ایک فائل ہونی چاہئے۔',
    'filled' => ': خصوصیت کے فیلڈ کی ایک قیمت ہونی چاہئے۔',
    'gt' => [
        'numeric' => ': خاصیت اس سے زیادہ ہونی چاہ.۔',
        'file' => ': خاصیت اس سے زیادہ ہونی چاہئے: ویلیو کلو بائٹ۔',
        'string' => ': خاصیت اس سے زیادہ ہونی چاہئے: قدر کے حرف۔
',
        'array' => ': خاصیت میں زیادہ سے زیادہ قیمت ہونی چاہ.۔
',
    ],
    'gte' => [
        'numeric' => ': خصوصیت اس سے زیادہ یا مساوی ہونی چاہئے۔
',
        'file' => ': خصوصیت اس سے زیادہ یا مساوی ہونی چاہئے: ویلیو کلو بائٹ۔',
        'string' => ': خاصیت سے زیادہ یا مساوی ہونا چاہئے: قدر حروف۔
',
        'array' => 'اس: وصف میں ہونا ضروری ہے: ویلیو آئٹمز یا زیادہ۔
',
    ],
    'image' => ': خصوصیت ایک شبیہہ ہونی چاہئے۔',
    'in' => 'منتخب کردہ: وصف غلط ہے۔
',
    'in_array' => ': انتساب فیلڈ میں موجود نہیں ہے: دوسرے۔
',
    'integer' => ': خصوصیت کا ایک عدد صحیح ہونا چاہئے۔
',
    'ip' => ': خصوصیت کا ایک درست IP پتہ ہونا چاہئے۔
',
    'ipv4' => ': خصوصیت ایک درست IPv4 پتہ ہونا چاہئے۔
',
    'ipv6' => ': خصوصیت ایک درست IPv6 پتہ ہونا چاہئے۔
',
    'json' => ': خاصیت ایک درست JSON تار ہونا ضروری ہے۔
',
    'lt' => [
        'numeric' => ': خصوصیت کم سے کم ہونی چاہئے: قدر۔
',
        'file' => ': خصوصیت کم سے کم ہونی چاہئے: ویلیو کلو بائٹ۔
',
        'string' => ': خاصیت کم سے کم ہونی چاہئے: قدر کے حرف۔
',
        'array' => ': خاصیت میں کم قیمت ہونی چاہ.۔
',
    ],
    'lte' => [
        'numeric' => ': خصوصیت کم یا مساوی ہونی چاہئے۔
',
        'file' => ': خصوصیت اس سے کم یا مساوی ہونی چاہئے: ویلیو کلو بائٹ۔
',
        'string' => ': خصوصیت اس سے کم یا مساوی ہونی چاہئے: قدر کے حرف۔
',
        'array' => ': خاصیت میں اس سے زیادہ نہیں ہونا چاہئے: ویلیو آئٹمز۔
',
    ],
    'max' => [
        'numeric' => ': انتساب اس سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ۔
',
        'file' => ': انتساب اس سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ کلو بائٹ۔
',
        'string' => ': خاصیت اس سے زیادہ نہیں ہو سکتی ہے: زیادہ سے زیادہ حرف۔
',
        'array' => 'اس: وصف میں زیادہ سے زیادہ اشیاء نہیں ہوسکتی ہیں۔
',
    ],
    'mimes' => ': خاصیت ایک قسم کی فائل ہونی چاہئے:: اقدار۔
',
    'mimetypes' => ': خاصیت ایک قسم کی فائل ہونی چاہئے:: اقدار۔
',
    'min' => [
        'numeric' => ': وصف کم از کم ہونا چاہئے: منٹ۔
',
        'file' => ': خصوصیت کم از کم ہونی چاہئے: کم سے کم کلو بائٹ۔
',
        'string' => ': وصف کم از کم ہونا چاہئے: کم سے کم حرف۔
',
        'array' => ': وصف میں کم از کم: منٹ آئٹم ہونا ضروری ہے۔
',
    ],
    'multiple_of' => ': خاصیت کا ایک سے زیادہ ہونا چاہئے: قدر
',
    'not_in' => 'منتخب کردہ: وصف غلط ہے۔
',
    'not_regex' => ': انتساب کی شکل غلط ہے۔
',
    'numeric' => ': خصوصیت کا ایک عدد ہونا چاہئے۔
',
    'password' => 'پاس ورڈ غلط ہے
',
    'present' => ': خصوصیت کا فیلڈ موجود ہونا چاہئے۔
',
    'regex' => ': انتساب کی شکل غلط ہے۔
',
    'required' => ': خصوصیت کا فیلڈ درکار ہے۔',
    'required_if' => ': خصوصیت کا فیلڈ درکار ہوتا ہے جب: دوسرا ہے: قدر۔
',
    'required_unless' => ': خصوصیت کے فیلڈ کی ضرورت ہے جب تک کہ: دوسرے میں: قدر نہیں۔
',
    'required_with' => 'جب: قدریں موجود ہوں تو: انتساب والے فیلڈ کی ضرورت ہوتی ہے۔
',
    'required_with_all' => ': قدریں موجود ہونے پر: وصف فیلڈ کی ضرورت ہوتی ہے۔
',
    'required_without' => 'جب: قدریں موجود نہیں ہیں تو: وصف فیلڈ کی ضرورت ہے۔
',
    'required_without_all' => ': خاصیت والے فیلڈ کی ضرورت ہوتی ہے جب: کوئی بھی اقدار موجود نہ ہوں۔
',
    'same' => ': اوصاف اور: دوسرے سے ملنا چاہئے۔
',
    'size' => [
        'numeric' => ': خاصیت ہونا ضروری ہے: سائز۔
',
        'file' => ': وصف ہونا ضروری ہے: سائز کلو بائٹ۔
',
        'string' => 'اس: وصف کا ہونا ضروری ہے: سائز حروف۔
',
        'array' => ': وصف میں ہونا ضروری ہے: سائز کی اشیاء۔
',
    ],
    'starts_with' => ': خصوصیت کا آغاز مندرجہ ذیل میں سے کسی ایک سے ہونا چاہئے:: اقدار۔
',
    'string' => 'اس: وصف کو اسٹرنگ ہونا چاہئے۔
',
    'timezone' => ': وصف ایک درست زون ہونا چاہئے۔
',
    'unique' => ': وصف پہلے ہی لیا جا چکا ہے۔
',
    'uploaded' => ': وصف منسوب کرنے میں ناکام۔
',
    'url' => ': انتساب کی شکل غلط ہے۔
',
    'uuid' => ': وصف ایک درست UID ہونا چاہئے۔
',
    'phone' => ': خصوصیت کا فیلڈ ایک غلط نمبر پر مشتمل ہے۔
',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'کسٹم پیغام
',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
